openfoam_cases/pipeCyclic/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   side1;
    }
    {
        name    f0;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box     (0 -100 -100)(100 -0.2 100);
    }
    {
        name    c0;
        type    cellSet;
        action  new;
        source  faceToCell;
        set     f0;
        option  any;
    }

    {
        name    walls;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   walls;
    }
    {
        name    c0;
        type    cellSet;
        action  subtract;
        source  faceToCell;
        set     walls;
        option  any;
    }
);


// ************************************************************************* //
